/*
Написать программу обработки файла записей, содержащую следующие подпункты меню : 
«Создание», «Просмотр», «Добавление», «Решение индивидуального задания».
Каждая запись должна содержать следующую информацию о студентах :
	- фамилия
	- номер группы
	- оценки за семестр : по физике, математике и информатике
	- средний балл
Организовать ввод исходных данных, средний балл рассчитать по введенным оценкам.Содержимое всего файла и результаты решения индивидуального задания записать в текстовый файл.

	Найти информацию о студентах, имеющих отметку 4 или 5 по физике и больше 8 по остальным предметам.
	*/
